%% 文件根据Excel配置表自动生成,修改可能会产生意外的问题,并且任何改动将在文件重新生成时丢失
%% 家族联盟活动积分奖励
-module(family_activity_score_setting).
-export([
		get_data/1
		,get_all/0
	]).

%% 获取所有id列表
get_all() -> [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20].


%% 根据id获取一条数据
%% 1 等级
%% 2 等级所需的积分
%% 3 成员等级奖励
%% 4 盟主等级奖励
get_data(1) -> {1000,[{coin,1000}],[{coin,1000}]};
get_data(2) -> {3000,[{coin,1001}],[{coin,1001}]};
get_data(3) -> {6000,[{coin,1002}],[{coin,1002}]};
get_data(4) -> {10000,[{coin,1003}],[{coin,1003}]};
get_data(5) -> {14000,[{coin,1004}],[{coin,1004}]};
get_data(6) -> {18000,[{coin,1005}],[{coin,1005}]};
get_data(7) -> {22000,[{coin,1006}],[{coin,1006}]};
get_data(8) -> {26000,[{coin,1007}],[{coin,1007}]};
get_data(9) -> {30000,[{coin,1008}],[{coin,1008}]};
get_data(10) -> {34000,[{coin,1009}],[{coin,1009}]};
get_data(11) -> {38000,[{coin,1010}],[{coin,1010}]};
get_data(12) -> {42000,[{coin,1011}],[{coin,1011}]};
get_data(13) -> {46000,[{coin,1012}],[{coin,1012}]};
get_data(14) -> {50000,[{coin,1013}],[{coin,1013}]};
get_data(15) -> {54000,[{coin,1014}],[{coin,1014}]};
get_data(16) -> {58000,[{coin,1015}],[{coin,1015}]};
get_data(17) -> {62000,[{coin,1016}],[{coin,1016}]};
get_data(18) -> {66000,[{coin,1017}],[{coin,1017}]};
get_data(19) -> {70000,[{coin,1018}],[{coin,1018}]};
get_data(20) -> {74000,[{coin,1019}],[{coin,1019}]}.

