%% 文件根据Excel配置表自动生成,修改可能会产生意外的问题,并且任何改动将在文件重新生成时丢失
%% 家族等级
-module(family_level_setting).
-export([
		get_data/1
		,get_all/0
	]).

%% 获取所有id列表
get_all() -> [1,2,3,4,5,6,7,8,9,10].


%% 根据id获取一条数据
%% 1 等级
%% 2 升级所需经验
%% 3 礼物宝箱列表(FamilyGiftBoxSetting随机开一个)
get_data(1) -> {0,[1]};
get_data(2) -> {1000,[1]};
get_data(3) -> {10000,[1,2]};
get_data(4) -> {50000,[1,2]};
get_data(5) -> {100000,[1,2,3]};
get_data(6) -> {150000,[1,2,3]};
get_data(7) -> {200000,[1,2,3,4]};
get_data(8) -> {250000,[1,2,3,4]};
get_data(9) -> {300000,[1,2,3,4,5]};
get_data(10) -> {350000,[1,2,3,4,5]}.

